
name: "lstm_music"
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  top: "clip_markers"
  hdf5_data_param {
     source: "/N/dc2/projects/omrdl/data/train_music.txt"
     batch_size: 10
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  top: "clip_markers"
  hdf5_data_param {
     source: "/N/dc2/projects/omrdl/data/test_music.txt"
     batch_size: 3
  }
  include: { phase: TEST stage: "test-on-test" }
}
layer{
  name: "reshape-data"
  type: "Reshape"
  bottom: "data"
  top: "data-reshape"
  reshape_param{
    shape{
      dim: 200
      dim: 10
      dim: 60
    }
  }
  include: { phase: TRAIN }
}
layer{
  name: "reshape-data"
  type: "Reshape"
  bottom: "data"
  top: "data-reshape"
  reshape_param{
    shape{
      dim: 200
      dim: 3
      dim: 60
    }
  }
  include: { phase: TEST stage: "test-on-test" }
}
layer{
  name: "reshape-label"
  type: "Reshape"
  bottom: "label"
  top: "reshape-label"
  reshape_param{
    shape{
      dim: 200
      dim: 10
    }
  }
  include: { phase: TRAIN }
}
layer{
  name: "reshape-label"
  type: "Reshape"
  bottom: "label"
  top: "reshape-label"
  reshape_param{
    shape{
      dim: 200
      dim: 3
    }
  }
  include: { phase: TEST stage: "test-on-test" }
}
layer{
  name: "reshape-cm"
  type: "Reshape"
  bottom: "clip_markers"
  top: "reshape-cm"
  reshape_param{
    shape{
      dim: 200
      dim: 10
    }
  }
  include: { phase: TRAIN }
}
layer{
  name: "reshape-cm"
  type: "Reshape"
  bottom: "clip_markers"
  top: "reshape-cm"
  reshape_param{
    shape{
      dim: 200
      dim: 3
    }
  }
  include: { phase: TEST stage: "test-on-test" }
}
layer {
  name: "lstm1"
  type: "LSTM"
  bottom: "data-reshape"
  bottom: "reshape-cm"
  top: "lstm1"
  recurrent_param {
    num_output: 256
    weight_filler {
      type: "uniform"
      min: -0.01
      max: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "lstm1-drop"
  type: "Dropout"
  bottom: "lstm1"
  top: "lstm1-drop"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8-final"
  type: "InnerProduct"
  bottom: "lstm1-drop"
  top: "fc8-final"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 101
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 2
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8-final"
  bottom: "reshape-label"
  top: "loss"
  softmax_param {
    axis: 2
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc8-final"
  bottom: "reshape-label"
  top: "accuracy"
  accuracy_param {
    axis: 2
  }
}